In [15]:
import pandas as pd
import numpy as np
import seaborn as sns
import ast, json

from datetime import datetime
import matplotlib.pyplot as plt
%matplotlib inline

In [38]:
data = pd.read_csv("Data/teaching_training_data.csv")
cft = pd.read_csv("Data/teaching_training_data_cft.csv")
com = pd.read_csv("Data/teaching_training_data_com.csv")
grit = pd.read_csv("Data/teaching_training_data_grit.csv")
num = pd.read_csv("Data/teaching_training_data_num.csv")
opt = pd.read_csv("Data/teaching_training_data_opt.csv")
data.head()

,Unnamed: 0,unid,survey_date_month,survey_num,gender,dob,province,working,job_start_date,job_leave_date,...,leadershiprole,peoplelive,peoplelive_15plus,numchildren,numearnincome,anygrant,anyhhincome,financial_situation_now,financial_situation_5years,givemoney_yes
0,1,41964,2018-06-01,1,Female,1992-02-01,NaN,True,2018-06-01,NaN,...,NaN,NaN,NaN,NaN,NaN,False,False,NaN,NaN,NaN
1,2,41964,2018-11-01,2,Female,1992-02-01,NaN,True,2018-04-30,2018-11-08,...,NaN,NaN,NaN,NaN,NaN,False,False,NaN,NaN,NaN
2,3,15241,2016-03-01,1,Female,1988-11-01,NaN,True,2015-03-01,2016-03-15,...,No,2,NaN,3,1,True,True,2,8,False
3,4,33702,2016-04-01,1,Male,1991-04-01,NaN,True,2016-02-01,2016-04-14,...,No,4,NaN,1,1,False,True,1 (Worst possible financial situation),1 (Worst possible financial situation),False
4,5,33702,2016-08-01,2,Male,1991-04-01,NaN,False,NaN,NaN,...,No,4,NaN,1,1,False,True,1 (Worst possible financial situation),1 (Worst possible financial situation),False

In [39]:
data.dtypes

Unnamed: 0                     int64
unid                           int64
survey_date_month             object
survey_num                     int64
gender                        object
dob                           object
province                      object
working                         bool
job_start_date                object
job_leave_date                object
company_size                  object
monthly_pay                   object
volunteer                     object
leadershiprole                object
peoplelive                    object
peoplelive_15plus             object
numchildren                   object
numearnincome                 object
anygrant                      object
anyhhincome                   object
financial_situation_now       object
financial_situation_5years    object
givemoney_yes                 object
dtype: object

In [40]:
data.apply('nunique')

Unnamed: 0                    83270
unid                          51262
survey_date_month                34
survey_num                        9
gender                            2
dob                             274
province                          9
working                           2
job_start_date                  160
job_leave_date                  851
company_size                      2
monthly_pay                      11
volunteer                         2
leadershiprole                    2
peoplelive                       21
peoplelive_15plus                17
numchildren                       6
numearnincome                    16
anygrant                          2
anyhhincome                       2
financial_situation_now          10
financial_situation_5years       10
givemoney_yes                     2
dtype: int64

In [41]:
cft.apply('nunique')

Unnamed: 0    58851
unid          32880
cft_score        10
dtype: int64

In [42]:
opt.apply('nunique')

Unnamed: 0    83270
unid          51262
opt_score        31
dtype: int64

In [43]:
com.apply('nunique')

Unnamed: 0    36639
unid          19347
com_score        10
dtype: int64

In [44]:
grit.apply('nunique')

Unnamed: 0    83270
unid          51262
grit_score       10
dtype: int64

In [34]:
columns_to_drop = ["job_start_date","job_leave_date","leadershiprole","peoplelive"
                   ,"peoplelive_15plus","numchildren","anygrant","anyhhincome"
                   ,"financial_situation_5years","financial_situation_now"
                   ,"givemoney_yes","province","dob"]
data = data.drop(columns_to_drop, axis=1)
data.head()
#i didnt think that those rows were relevant to our question but if we want to keep some then cool.

,Unnamed: 0,unid,survey_date_month,survey_num,gender,working,company_size,monthly_pay,volunteer,numearnincome
0,1,41964,2018-06-01,1,Female,True,More than 200 employees,Between R2001 and 3000,NaN,NaN
1,2,41964,2018-11-01,2,Female,True,NaN,NaN,NaN,NaN
2,3,15241,2016-03-01,1,Female,True,NaN,NaN,No,1
3,4,33702,2016-04-01,1,Male,True,NaN,NaN,Yes,1
4,5,33702,2016-08-01,2,Male,False,NaN,NaN,Yes,1

In [35]:
data.head()

,Unnamed: 0,unid,survey_date_month,survey_num,gender,working,company_size,monthly_pay,volunteer,numearnincome
0,1,41964,2018-06-01,1,Female,True,More than 200 employees,Between R2001 and 3000,NaN,NaN
1,2,41964,2018-11-01,2,Female,True,NaN,NaN,NaN,NaN
2,3,15241,2016-03-01,1,Female,True,NaN,NaN,No,1
3,4,33702,2016-04-01,1,Male,True,NaN,NaN,Yes,1
4,5,33702,2016-08-01,2,Male,False,NaN,NaN,Yes,1

In [36]:
columns_2_drop = ["Unnamed: 0","company_size","monthly_pay","volunteer","numearnincome"]
data = data.drop(columns_2_drop, axis=1)
data.head()

    unid survey_date_month  survey_num  gender  working
0  41964        2018-06-01           1  Female     True
1  41964        2018-11-01           2  Female     True
2  15241        2016-03-01           1  Female     True
3  33702        2016-04-01           1    Male     True
4  33702        2016-08-01           2    Male    False

In [ ]:
data.shape

In [ ]:
df = pd.merge(data,cft, how = 'outer', on = 'unid')
df = pd.merge(df,num, how = 'outer', on = 'unid')
df = pd.merge(df,com, how = 'outer', on = 'unid')
df = pd.merge(df,grit, how = 'outer', on = 'unid')
df = pd.merge(df,opt, how = 'outer', on = 'unid')
df.head()
#this way by doing 'outer' i have not dropped any rows but created multiple copies, later i get rid of the unneccesary ones.

In [ ]:
df.shape

In [ ]:
print(df.isnull().sum())

In [ ]:
print(df.shape)

# Rows containing duplicate data
duplicate_rows_df = df[df.duplicated()]

print(duplicate_rows_df.shape)

In [ ]:
df.aggregate?

In [ ]:
df_new = df.groupby(df['unid']).aggregate({'gender': 'first','working':'last'
                                           ,'num_score': 'max','com_score': 'max'
                                           ,'cft_score': 'max','grit_score': 'max'
                                           ,'opt_score': 'mean'})
#the idea here being that i have kept all the participants and decided that for the opt score i would take the mean. 
#may nit have been the best way to do it but i think this leaves all the relevant information without data mining.
# I took the mean of the opt scores because they go into negatives and here were no obvious outliers.

In [ ]:
df_new.head(10)

In [ ]:
df_new.shape #so we still have all the participants included as the total of unique participants in 51,262.

In [ ]:
df.apply('nunique')

In [ ]:
import missingno as msno

msno.matrix(df_new); #so as we can see, grit is the only thing that everyone seems to have done.

In [ ]:
from ipywidgets import interact, fixed

In [ ]:
def numerical_variable_distribution(df_new, col):
    df_new[col].plot.hist()

In [ ]:
numerical_columns = df_new.select_dtypes(include=[np.number]).columns.tolist()
interact(numerical_variable_distribution, 
         col=numerical_columns, df_new=fixed(df_new));

In [ ]:
plt.plot('grit_score','working', data=df_new)
plt.show()
#obviously this shows us nothing....but it looks awesome. so i'm gonna leave it here